zhelezyaka/lev-gen2-stm8s005k6/ lev-gen2-stm8s005k6/src/LevG2_mainfun.c
/********************************************************************************
* Include																		*
********************************************************************************/
#include "stm8s.h"
#include "Global_config.h"
#include "Module_Driver_Define.h"
#include "SystemInformation\User_Define_Parser.h"
#include "Module_Variable_Define.h"
#include "Module_Var_Bit_Define.h"
#include "SystemInformation\SystemInfo.h"
#include "DefinePollingFunctions.h"
#include "SOC\SOC.h"

/********************************************************************************
* Define																		*
********************************************************************************/
#define STAY_IN_HALT_MODE_DELAY_CYCLE  156     //10 sec = STAY_IN_HALT_MODE_DELAY_CYCLE * TimerIntervalTimeBase_MS

/********************************************************************************
* Extern Function																*
********************************************************************************/


/********************************************************************************
* Extern Variable																*
********************************************************************************/

/********************************************************************************
* Global Variable																*
********************************************************************************/
/********************************************************************************
* Local Variable																*
********************************************************************************/
unsigned char Switch_HALT_Normal_MODE_Holging_counter;

/* Public functions ----------------------------------------------------------*/
/**
  * @brief Example firmware main entry point.
  * @par Parameters:
  * None
  * @retval
  * None
  */
//IN_RAM(void system_halt(void))
//{
//	while (1)
//	{
//            halt();
//	}
//}

//////////////////////////////////////////////////////////////////////////////
unsigned char check;
//unsigned char count;
//unsigned char testArray[128];
//unsigned char t1;
//unsigned int t2;
//unsigned long t3;
//float f;
//__no_init EEPROM unsigned int eeprom_t1;
//unsigned char __eeprom *p;
//unsigned int __eeprom *p1;
unsigned int FirstInitial_Func(){
	
	System_clk_setup();
    delay_cycles(100); //about 960us at 4MHz
/////////////////////////////////
    
//////////////////////////////    
    InitMosControl();
	// Initialize LEDs
	InitLEDDisplay();
    
    //while(1);
   

    delay_cycles(5);  //about 90us at 4MHz
    delay_cycles(10); //about 132us at 4MHz
    delay_cycles(20); //about 224us at 4MHz
    delay_cycles(30); //about 318us at 4MHz
    delay_cycles(40); //about 410us at 4MHz
    delay_cycles(50); //about 502us at 4MHz
    delay_cycles(100); //about 960us at 4MHz
    delay_cycles(100); //about 960us at 4MHz
    delay_cycles(100); //about 960us at 4MHz
	

  return StartUp;
}


unsigned int Startup_Func()
{
  
	//Initialization
	disableInterrupts();  /* disable interrupts */
    SetLedFlashing();

	
	G_Module_Status = 0;
    G_Auxiliary_Module_Status = 0;
	G_SystemFailureStatus = 0;
    G_LED_Interface_Status1 = 0;
    G_LED_Interface_Status2 = 0;
    G_Device_Interface_Status1 = 0;
    G_Add_Device_Interface_Status = 0;

 
    G_DSG_Current_ADC = 0;
    G_CHG_Current_ADC = 0;
    G_VBAT_ADC = 0;
    G_TH1_ADC = 0;
    G_SOC_ADC = 0;
    G_TH2_ADC = 0;

	
	InitLEDDisplay();
    InitMosControl();
    InitButtonEvent();
    InitInputSignalPin();
    
    
    delay_cycles(5);
    InitAdapterOutputSignal();
    InitUARTFunction();
    
    SysInfo_init();
    
    /////////////////////////////////
    InitSubPollingProtectionVariables();
    InitADCFunction();
    Set_Interrupt_ADC_Conversion_Finish_Function(ProtectionForPolling); //wait for startAdcConversion()
    
    /////////////////////////////////
    InitTimerPollingVariables();
    //InitTimerFunction();
    InitAWUTimerFunction();
    Set_AWU_Shorter_Timer_Interval_Time_Base();

    
	enableInterrupts();  /* enable interrupts */
    
    if(!(System_Control_Bit_EEPROM & Calibration_Done)){
        return ShutdownMode;   
    }
    
    return NormalMode;
}

unsigned char inverse_led1_flag = 0;
unsigned char inverse_led2_flag = 0;
unsigned char oneSec_flag = 0;

unsigned int Normal_Func(){
    
    unsigned char capacity;
   
    //Set_Interrupt_Timer_Calling_Function(1, TimerCounterForPolling);   //64ms
    //Set_Interrupt_Timer_Calling_Function(2, startAdcConversion);       //64ms
    //Set_Interrupt_Timer_Calling_Function(3, UpdatedSystemRecordingInfoForPolling);       //64ms
    //G_Auxiliary_Module_Status &= ~Halt_Mode;
    
    Set_Interrupt_AWU_Timer_Calling_Function(1, TimerCounterForPolling);   //64ms
    Set_Interrupt_AWU_Timer_Calling_Function(2, startAdcConversion);       //64ms
    Set_Interrupt_AWU_Timer_Calling_Function(3, UpdatedSystemRecordingInfoForPolling);       //64ms
    Set_Interrupt_AWU_Timer_Calling_Function(4, LastPollingFunction);       //64ms
    G_Auxiliary_Module_Status |= Halt_Mode;
    
    Set_IntoHaltModeDelay_Counter_Cycles(STAY_IN_HALT_MODE_DELAY_CYCLE);
//    while(1){
//        if(G_Device_Interface_Status1 & BUTTON_PRESS){
//            return ShutdownMode;
//        }
//    }
    inverse_led1_flag = 0;
    inverse_led2_flag = 0;
    oneSec_flag = 0;
    if(G_Auxiliary_Module_Status & Halt_Mode){
        halt();
    }
    while(1){
        
        //if(true || 
        if((G_Device_Interface_Status1 & BUTTON_CLICK) || 
           (G_Device_Interface_Status1 & BUTTON_LONG_PRESS) ||
           (G_Device_Interface_Status1 & BUTTON_MULTI_CLICK)){
               
            ////////////////////////////////////////////////////////////
            // into normal wfi mode
            if(G_Auxiliary_Module_Status & Halt_Mode){
                DisableAWUTimerFunction();
                InitTimerFunction();
                Set_Interrupt_Timer_Calling_Function(1, TimerCounterForPolling);   //64ms
                Set_Interrupt_Timer_Calling_Function(2, startAdcConversion);       //64ms
                Set_Interrupt_Timer_Calling_Function(3, UpdatedSystemRecordingInfoForPolling);       //64ms
                Set_Interrupt_Timer_Calling_Function(4, LastPollingFunction);       //64ms
                G_Auxiliary_Module_Status &= ~Halt_Mode;
                G_Add_Device_Interface_Status |= ENABLE_AUX1_COUNTER;
            }else{
                Recount_IntoHaltModeDelay_Counter();
            }                   
        }
        
        
        if(G_Device_Interface_Status1 & BUTTON_CLICK){
            G_Device_Interface_Status1 &= ~BUTTON_CLICK;
            if(G_Module_Status  & Current_Dir_DSG){
                capacity = getCapacityByCellVoltage( G_VBAT_ADC, G_DSG_Current_ADC,  true);
            }else{
                capacity = getCapacityByCellVoltage( G_VBAT_ADC, G_CHG_Current_ADC,  false);
            }
            DisplayCapacity(capacity, true);

            if(inverse_led1_flag == 0){
                //SetLedPWMFunction(LED1+LED4+LED5, TurnOn);
                //SetLedPWMFunction(LED4+LED5, TurnOn);
                //SetLedSerialTurnOnOff_ByTimer(TurnOn);
                //SetLedLightOnFlag(LED1, TurnOn);
            }else{
                //SetLedPWMFunction(LED1+LED4+LED5, TurnOff);
                //SetLedLightOnFlag(LED1, TurnOff);
                //SetLedSerialTurnOnOff_ByTimer(TurnOff);
            }
            inverse_led1_flag ^= 0x01;
        }
        
        if(G_Device_Interface_Status1 & BUTTON_LONG_PRESS){
            G_Device_Interface_Status1 &= ~BUTTON_LONG_PRESS;

