zhelezyaka/lev-gen2-stm8s005k6/ lev-gen2-stm8s005k6/src/LevG2_mainfun.c
            //SetLedSerialTurnOnOff_ByIO(TurnOff);
            SetLedSerialTurnOnOff_ByTimer(TurnOff);
            return ShutdownMode; 

            if(inverse_led2_flag == 0){
                //SetLedLightOnFlag(LED2, TurnOn);
            }else{
                //SetLedLightOnFlag(LED2, TurnOff);
            }
            inverse_led2_flag ^= 0x01;
        }
        
         if(G_Device_Interface_Status1 & BUTTON_MULTI_CLICK){
             G_Device_Interface_Status1 &= ~BUTTON_MULTI_CLICK;
             if(G_Auxiliary_Module_Status & _3RD_Function_ON){
                 G_Auxiliary_Module_Status &= ~_3RD_Function_ON;
             }else{
                 G_Auxiliary_Module_Status |= _3RD_Function_ON;
             }
         }
        
        
        if(G_Auxiliary_Module_Status & SYS_1_SEC_FLAG){
            G_Auxiliary_Module_Status &= ~SYS_1_SEC_FLAG;
            if(G_Auxiliary_Module_Status & _3RD_Function_ON){
            }
            if (System_Control_Bit_EEPROM & EnableSendSystemData){
                UART_Send_Word_CRC(G_Var_Array, GVarArraySize, true);
            }
            if (System_Control_Bit_EEPROM & EnableSendEEPROMData){
                UART_Send_EEPROM_DATA_CRC_with_PrecedingCheckCode();
            }
        }
////////////////////////////////////////////////////////////////////////////////////////////////////////        
        //////////////////////////////
        // for test
//        if(G_Add_Device_Interface_Status & AUX1_COUNTING_FINISH){
//            G_Add_Device_Interface_Status &= ~AUX1_COUNTING_FINISH;
//        }
//        if(oneSec_flag > 15){
//            oneSec_flag = 0;
//            GPIO_WriteReverse(GPIOC, GPIO_PIN_3);
//        }else{
//            oneSec_flag++;
//        }
////////////////////////////////////////////////////////////////////////////////////////////////////////        
           
           
        ////////////////////////////////////////////////////////////
        // into Halt mode
        if(((G_Auxiliary_Module_Status & Halt_Mode)==0)&&(G_Add_Device_Interface_Status & AUX1_COUNTING_FINISH)){
            G_Add_Device_Interface_Status &= ~AUX1_COUNTING_FINISH;
            DisableTimerFunction();
            InitAWUTimerFunction();
            Set_Interrupt_AWU_Timer_Calling_Function(1, TimerCounterForPolling);   //64ms
            Set_Interrupt_AWU_Timer_Calling_Function(2, startAdcConversion);       //64ms
            Set_Interrupt_AWU_Timer_Calling_Function(3, UpdatedSystemRecordingInfoForPolling);       //64ms
            Set_Interrupt_AWU_Timer_Calling_Function(4, LastPollingFunction);       //64ms
            G_Auxiliary_Module_Status |= Halt_Mode;
        }
        
        delay_cycles(100); //about 960us at 4MHz
//        if(G_Add_Device_Interface_Status & LAST_POLLING_FLAG){
//            G_Add_Device_Interface_Status &= ~LAST_POLLING_FLAG;
//            if(G_Auxiliary_Module_Status & Halt_Mode){
//                halt();
//            }else{
//                wfi(); 
//            }
//        }
        if(G_Auxiliary_Module_Status & Halt_Mode){
            if((G_Device_Interface_Status1 & ADC_SET_CONVERSION) == 0){
                halt();
            }
        }else{
            if((G_Device_Interface_Status1 & ADC_SET_CONVERSION) == 0){
                wfi();  /* Wait For Interrupt */
            }
        }
        
//        delay_cycles(5);  //about 90us at 4MHz
//        delay_cycles(10); //about 132us at 4MHz
//        delay_cycles(20); //about 224us at 4MHz
//        delay_cycles(30); //about 318us at 4MHz
//        delay_cycles(40); //about 410us at 4MHz
//        delay_cycles(50); //about 502us at 4MHz
//        delay_cycles(100); //about 960us at 4MHz
//        delay_cycles(100); //about 960us at 4MHz
//        delay_cycles(100); //about 960us at 4MHz
//        for(int i = 0; i < 10;i++){
//            //delay_cycles(100); //about 960us at 4MHz
//        }        
    }//while(1);   
    return ShutdownMode;
}

unsigned int Shutdown_Func(){
    
    //unsigned char flag;
    
    for(int i = 0; i < 100;i++){
        delay_cycles(100); //about 960us at 4MHz
    }        
    setMosFET(CHG_MOSFET, TurnOff);
    setMosFET(DSG_MOSFET, TurnOff);
    InitTimerPollingVariables();
    Set_IntoHaltModeDelay_Counter_Cycles(STAY_IN_HALT_MODE_DELAY_CYCLE);
    
    DisableAWUTimerFunction();
    if(G_Auxiliary_Module_Status & _3RD_Function_ON){
    }
    if (System_Control_Bit_EEPROM & EnableSendSystemData){
        UART_Send_Word_CRC(G_Var_Array, GVarArraySize, true);
    }
    if (System_Control_Bit_EEPROM & EnableSendEEPROMData){
        UART_Send_EEPROM_DATA_CRC_with_PrecedingCheckCode();
    }

    
    while(1){
        DisableTimerFunction();
        stopAdcConversion();
//        /*Configure all the IO as Output Push pull at low level exept PA1 and PA2 (OSCIN and OSCOUT)*/
//        /*GPIOA*/
//        /*otherwise it's defined as Push pull at low level */
//        GPIOA->ODR = 0x00;    //OUTPUT HIGH/LOW
//        GPIOA->DDR = 0x7F;    //Set "1" as Output mode,
//        GPIOA->CR1 = 0x7F;    /* Pull-Up or Push-Pull */
//        /*GPIOB*/
//        GPIOB->ODR = 0x00;
//        GPIOB->DDR = 0xFF;
//        GPIOB->CR1 = 0xFF;
//        /*GPIOC*/
//        GPIOC->ODR = 0x00;
//        GPIOC->DDR = 0xFF;
//        GPIOC->CR1 = 0xFF;
//        /*GPIOD*/
//        GPIOD->ODR = 0x00;
//        GPIOD->DDR = 0xFF;
//        GPIOD->CR1 = 0xFF;
//        /*GPIOE*/
//        GPIOE->ODR = 0x00;
//        GPIOE->DDR = 0xFF;
//        GPIOE->CR1 = 0xFF;
//        /*GPIOF*/
//        GPIOF->ODR = 0x00;
//        GPIOF->DDR = 0xFF;
//        GPIOF->CR1 = 0xFF;
        
        //InitButtonEvent();
        halt(); 
        
        //InitUARTFunction();        
        InitTimerFunction();
        Set_Interrupt_Timer_Calling_Function(1, TimerCounterForPolling);   //64ms

        G_Add_Device_Interface_Status |= ENABLE_AUX1_COUNTER;
    
        //UART_Send_Word_CRC(G_Var_Array, GVarArraySize, true);
        
        //GPIO_WriteHigh(GPIOC, GPIO_PIN_1);
        while(1){
            if(G_Add_Device_Interface_Status & AUX1_COUNTING_FINISH){
                UART_Send_Word_CRC(G_Var_Array, GVarArraySize, true);
                G_Add_Device_Interface_Status &= ~AUX1_COUNTING_FINISH;
                break;
            }
            if(G_Device_Interface_Status1 & BUTTON_LONG_PRESS){
                G_Device_Interface_Status1 &= ~BUTTON_LONG_PRESS;
                Recount_IntoHaltModeDelay_Counter();
                //SetLedSerialTurnOnOff_ByIO(TurnOn);
                return StartUp;
            }
            if(G_Device_Interface_Status1 & BUTTON_CLICK){
                G_Device_Interface_Status1 &= ~BUTTON_CLICK;
                Recount_IntoHaltModeDelay_Counter();
            }
            if(G_Device_Interface_Status1 & BUTTON_MULTI_CLICK){
                G_Device_Interface_Status1 &= ~BUTTON_MULTI_CLICK;
                Recount_IntoHaltModeDelay_Counter();
                //return CalibrationMode;
            }
            if(G_Auxiliary_Module_Status & SYS_1_SEC_FLAG){
                G_Auxiliary_Module_Status &= ~SYS_1_SEC_FLAG;
                if(G_Auxiliary_Module_Status & _3RD_Function_ON){
                }
                if (System_Control_Bit_EEPROM & EnableSendSystemData){
                    UART_Send_Word_CRC(G_Var_Array, GVarArraySize, true);
                }
                if (System_Control_Bit_EEPROM & EnableSendEEPROMData){
                    UART_Send_EEPROM_DATA_CRC_with_PrecedingCheckCode();
                }
            }
            if(G_Add_Device_Interface_Status & SYSTEM_CHANGE_MODE){
                G_Add_Device_Interface_Status &= ~SYSTEM_CHANGE_MODE;
                return StartUp;
            }
            
